platformio/platform-ststm32/misc/svd/STM32F779.svd
        <register>
          <name>DHTMEM5</name>
          <displayName>DHTMEM5</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x370</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM6</name>
          <displayName>DHTMEM6</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x374</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM7</name>
          <displayName>DHTMEM7</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x378</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM8</name>
          <displayName>DHTMEM8</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x37C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM9</name>
          <displayName>DHTMEM9</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM10</name>
          <displayName>DHTMEM10</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x384</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM11</name>
          <displayName>DHTMEM11</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x388</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM12</name>
          <displayName>DHTMEM12</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x38C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM13</name>
          <displayName>DHTMEM13</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x390</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM14</name>
          <displayName>DHTMEM14</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x394</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM15</name>
          <displayName>DHTMEM15</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x398</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM16</name>
          <displayName>DHTMEM16</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x39C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM17</name>
          <displayName>DHTMEM17</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM18</name>
          <displayName>DHTMEM18</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM19</name>
          <displayName>DHTMEM19</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM20</name>
          <displayName>DHTMEM20</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM21</name>
          <displayName>DHTMEM21</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM22</name>
          <displayName>DHTMEM22</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM23</name>
          <displayName>DHTMEM23</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM24</name>
          <displayName>DHTMEM24</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM25</name>
          <displayName>DHTMEM25</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM26</name>
          <displayName>DHTMEM26</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM27</name>
          <displayName>DHTMEM27</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM28</name>
          <displayName>DHTMEM28</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM29</name>
          <displayName>DHTMEM29</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM30</name>
          <displayName>DHTMEM30</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM31</name>
          <displayName>DHTMEM31</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM32</name>
          <displayName>DHTMEM32</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM33</name>
          <displayName>DHTMEM33</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM34</name>
          <displayName>DHTMEM34</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM35</name>
          <displayName>DHTMEM35</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM36</name>
          <displayName>DHTMEM36</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM37</name>
          <displayName>DHTMEM37</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM38</name>
          <displayName>DHTMEM38</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM39</name>
          <displayName>DHTMEM39</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM40</name>
          <displayName>DHTMEM40</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM41</name>
          <displayName>DHTMEM41</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM42</name>
          <displayName>DHTMEM42</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM43</name>
          <displayName>DHTMEM43</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM44</name>
          <displayName>DHTMEM44</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x40C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM45</name>
          <displayName>DHTMEM45</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
