platformio/platform-ststm32/misc/svd/STM32F779.svd
        <register>
          <name>HUFFENC_AC1_52</name>
          <displayName>HUFFENC_AC1_52</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x730</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_53</name>
          <displayName>HUFFENC_AC1_53</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x734</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_54</name>
          <displayName>HUFFENC_AC1_54</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x738</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_55</name>
          <displayName>HUFFENC_AC1_55</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x73C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_56</name>
          <displayName>HUFFENC_AC1_56</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x740</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_57</name>
          <displayName>HUFFENC_AC1_57</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x744</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_58</name>
          <displayName>HUFFENC_AC1_58</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x748</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_59</name>
          <displayName>HUFFENC_AC1_59</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x74C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_60</name>
          <displayName>HUFFENC_AC1_60</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x750</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_61</name>
          <displayName>HUFFENC_AC1_61</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x754</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_62</name>
          <displayName>HUFFENC_AC1_62</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x758</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_63</name>
          <displayName>HUFFENC_AC1_63</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x75C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_64</name>
          <displayName>HUFFENC_AC1_64</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x760</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_65</name>
          <displayName>HUFFENC_AC1_65</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x764</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_66</name>
          <displayName>HUFFENC_AC1_66</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x768</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_67</name>
          <displayName>HUFFENC_AC1_67</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x76C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_68</name>
          <displayName>HUFFENC_AC1_68</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x770</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_69</name>
          <displayName>HUFFENC_AC1_69</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x774</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_70</name>
          <displayName>HUFFENC_AC1_70</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x778</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_71</name>
          <displayName>HUFFENC_AC1_71</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x77C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_72</name>
          <displayName>HUFFENC_AC1_72</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x780</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_73</name>
          <displayName>HUFFENC_AC1_73</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x784</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_74</name>
          <displayName>HUFFENC_AC1_74</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x788</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_75</name>
          <displayName>HUFFENC_AC1_75</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x78C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_76</name>
          <displayName>HUFFENC_AC1_76</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x790</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_77</name>
          <displayName>HUFFENC_AC1_77</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x794</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_78</name>
          <displayName>HUFFENC_AC1_78</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x798</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_79</name>
          <displayName>HUFFENC_AC1_79</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x79C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_80</name>
          <displayName>HUFFENC_AC1_80</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x7A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_81</name>
          <displayName>HUFFENC_AC1_81</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x7A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_82</name>
          <displayName>HUFFENC_AC1_82</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x7A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_83</name>
          <displayName>HUFFENC_AC1_83</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x7AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_84</name>
          <displayName>HUFFENC_AC1_84</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x7B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_85</name>
          <displayName>HUFFENC_AC1_85</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x7B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_86</name>
          <displayName>HUFFENC_AC1_86</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x7B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_87</name>
          <displayName>HUFFENC_AC1_87</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x7BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_DC0_0</name>
          <displayName>HUFFENC_DC0_0</displayName>
          <description>JPEG encoder, DC Huffman table
          0</description>
          <addressOffset>0x7C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_DC0_1</name>
          <displayName>HUFFENC_DC0_1</displayName>
          <description>JPEG encoder, DC Huffman table
          0</description>
          <addressOffset>0x7C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_DC0_2</name>
          <displayName>HUFFENC_DC0_2</displayName>
          <description>JPEG encoder, DC Huffman table
          0</description>
          <addressOffset>0x7C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
